In [33]:
import pandas as pd

In [34]:
df=pd.read_csv('Messy_Employment_India_Dataset.csv')
df.head()

,Status,Age Group,Education,Industry,Location,AI Risk,Years of Experience,Monthly Salary (INR),Date Recorded
0,EMPLOYED,25_34,high school,Technology,Urban,NaN,NaN,40700.0,1/1/2023
1,EMPLOYED,18-24,Diploma,Fintech,rural,moderate,NaN,17500.0,1/2/2023
2,EMPLOYED,25_34,High School,Retail,Delhi,Low,16.0,77600.0,1/3/2023
3,UNEMPLOYED,18-24,Masters,Retail,Urban,Low,30.0,100200.0,1/4/2023
4,NaN,45-54,Diploma,Fintech,Hyderabad,low,9.0,19500.0,1/5/2023

In [35]:
df.describe()

       Years of Experience  Monthly Salary (INR)
count           980.000000           1613.000000
mean             15.244898          76886.360818
std               9.103941          41628.008054
min               0.000000           5100.000000
25%               7.000000          40700.000000
50%              16.000000          77200.000000
75%              23.000000         112400.000000
max              30.000000         149900.000000

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Status                1732 non-null   object
 1   Age Group             1768 non-null   object
 2   Education             1804 non-null   object
 3   Industry              1799 non-null   object
 4   Location              1787 non-null   object
 5   AI Risk               1716 non-null   object
 6   Years of Experience   980 non-null    float64
 7   Monthly Salary (INR)  1613 non-null   float64
 8   Date Recorded         2000 non-null   object
dtypes: float64(2), object(7)
memory usage: 140.8+ KB

In [37]:
df.shape

(2000, 9)

In [38]:
df.columns

Index(['Status', 'Age Group', 'Education', 'Industry', 'Location', 'AI Risk',
       'Years of Experience', 'Monthly Salary (INR)', 'Date Recorded'],
      dtype='object')

In [39]:
df.isna().sum()

Status                   268
Age Group                232
Education                196
Industry                 201
Location                 213
AI Risk                  284
Years of Experience     1020
Monthly Salary (INR)     387
Date Recorded              0
dtype: int64

In [40]:
df.dropna(how='all', inplace=True)

In [41]:
df.duplicated().sum()

np.int64(0)

In [42]:
# Data Cleaning Status
# df['Status'].unique()
# for x in df['Status'].index:
#     if df['Status'].loc[x] in ('EMPLOYED' ,'employed'):
#         df['Status'].loc[x]='Employed'
#     elif df['Status'].loc[x] in ( 'UNEMPLOYED', 'unemployed'):
#         df['Status'].loc[x]='Unemployed'

df['Status'] = df['Status'].str.strip().str.lower()
df['Status']=df['Status'].replace({
    'employed': 'Employed',
    'unemployed': 'Unemployed'
})

In [43]:
# Data cleaning Age Group
df['Age Group'].str.strip()
df['Age Group']=df['Age Group'].str.replace(' ','')
df['Age Group']=df['Age Group'].str.replace('_','-')
df['Age Group']=df['Age Group'].str.replace('to','-')

In [44]:
# Data Cleaning Education
df['Education']=df['Education'].str.lower().str.strip()
df['Education']=df['Education'].replace({
    'high school':'High school',
    'master':"Master's",
    "masters":"Master's",
    'phd':'PhD',
    'ph.d':'PhD',
    'bachelors':"Bachelor’s",
    "bachelor's":"Bachelor’s",
    'diploma':'Diploma'
})
df['Education'].unique()

array(['High school', 'Diploma', "Master's", 'PhD', 'Bachelor’s', nan],
      dtype=object)

In [45]:
# Data Cleaning Industry

df['Industry']=df['Industry'].str.strip()
df['Industry']=df['Industry'].replace({
    'Tech':'Technology',
    'Fintech':'Finance',
    'Health':'Healthcare'
})
df['Industry'].unique()

array(['Technology', 'Finance', 'Retail', nan, 'Healthcare', 'Education'],
      dtype=object)

In [46]:
# Data Cleaning Location
df['Location']=df['Location'].str.strip().str.lower()
df['Location']=df['Location'].replace({
    'urban':'Urban',
    'rural':'Rural',
    'delhi':"Delhi",
    'hyderabad':'Hyderabad',
    'bangalore':'Bangalore',
    'mumbai':'Mumbai',
    'suburban':'Suburban'
})
df['Location'].unique()

array(['Urban', 'Rural', 'Delhi', 'Hyderabad', 'Bangalore', 'Mumbai', nan,
       'Suburban'], dtype=object)

In [47]:
# Data Cleaning AI Risk
df['AI Risk']=df['AI Risk'].str.strip().str.lower().str.capitalize()
df['AI Risk']=df['AI Risk'].replace({
    'Moderate':'Medium'
})
df['AI Risk'].unique()

array([nan, 'Medium', 'Low', 'High'], dtype=object)

In [48]:
# Data Cleaning Years of Experience
df['Years of Experience']

0        NaN
1        NaN
2       16.0
3       30.0
4        9.0
        ...
1995     NaN
1996    22.0
1997     NaN
1998    22.0
1999     NaN
Name: Years of Experience, Length: 2000, dtype: float64

In [49]:
# Data Cleaning Monthly Salary 
df['Monthly Salary (INR)']

0        40700.0
1        17500.0
2        77600.0
3       100200.0
4        19500.0
          ...
1995    113000.0
1996    102200.0
1997     31600.0
1998     92500.0
1999     43300.0
Name: Monthly Salary (INR), Length: 2000, dtype: float64

In [50]:
# Data Cleaning Date Recorded
df['Date Recorded']=pd.to_datetime(df['Date Recorded'], format='%m/%d/%Y')
df['Date Recorded']

0      2023-01-01
1      2023-01-02
2      2023-01-03
3      2023-01-04
4      2023-01-05
          ...
1995   2028-06-18
1996   2028-06-19
1997   2028-06-20
1998   2028-06-21
1999   2028-06-22
Name: Date Recorded, Length: 2000, dtype: datetime64[ns]

In [51]:
df.tail(700)

,Status,Age Group,Education,Industry,Location,AI Risk,Years of Experience,Monthly Salary (INR),Date Recorded
1300,Unemployed,25-34,Bachelor’s,Retail,Urban,High,2.0,56700.0,2026-07-24
1301,NaN,NaN,Bachelor’s,Education,Hyderabad,Medium,11.0,NaN,2026-07-25
1302,NaN,18-24,Diploma,NaN,NaN,High,NaN,146800.0,2026-07-26
1303,Unemployed,25-34,Master's,Retail,Delhi,High,2.0,87600.0,2026-07-27
1304,Employed,45-54,Master's,NaN,Delhi,High,9.0,131600.0,2026-07-28
...,...,...,...,...,...,...,...,...,...
1995,Employed,25-34,PhD,Finance,Hyderabad,Low,NaN,113000.0,2028-06-18
1996,Employed,25-34,PhD,Technology,NaN,NaN,22.0,102200.0,2028-06-19
1997,NaN,35-44,Master's,Education,NaN,Low,NaN,31600.0,2028-06-20
1998,Employed,25-34,High school,Retail,Mumbai,High,22.0,92500.0,2028-06-21
1999,Unemployed,25-34,High school,NaN,NaN,Medium,NaN,43300.0,2028-06-22

In [52]:
df.to_csv("with_null_cleaned_data.csv",index=False)

In [53]:
df_clean=df.dropna()
df_clean.to_csv('without_null_cleaned_data.csv',index=False)